Repository: common-repository/registration-agreement-checkboxes
Catalog: lang/yp-agreement-checkboxes-*.po
Languages: pl_pl

source: You must agree to all terms
pl_pl: Musisz zaakceptować wszystkie wymagane warunki

source: Registration Checkboxes
pl_pl: Pola wyboru zgód (RODO)

source: is dedicated to extend WooCommerce functionality so it requires that plugin to be activated.
pl_pl: rozszerzają funkcjonalność wtyczki WooCommerce, więc jest wymagane, aby tamta wtyczka była aktywna.

source: The double password feature has been enabled and is now active.
pl_pl: Opcja podwójnego hasła została włączona i jest aktywna.

source: Woocommerce's "Automatically generate customer password" must be disabled in order for this very plugin to work properly.
pl_pl: Opcja WooCommerce'a "Podczas tworzenia konta, automatycznie generuj hasło do konta" musi być wyłączona, aby wtyczka działała poprawnie.

source: Would you like to disable this option?
pl_pl: Czy wyłączyć tę opcję?

source: Yes, disable auto-password generator
pl_pl: Tak, wyłącz automatyczne generowanie hasła.

source: Agreement checkboxes
pl_pl: Pola wyboru zgód (RODO)

source: Double password
pl_pl: Podwójne hasło

source: Double password feature
pl_pl: Opcja podwójnego hasła

source: Turn on/off the double password validation
pl_pl: Włącz / wyłącz opcję podwójnego hasła

source: No
pl_pl: Nie

source: Yes
pl_pl: Tak

source: Checkboxes copy
pl_pl: Pola wyboru zgód - opis dla użytkownika

source: Enter a description of the Agreement checkboxes here (optional)
pl_pl: Dodaj opis Pól Zgód (nie wymagane)

source: Edit checkboxes
pl_pl: Edytuj Pola wyboru zgód (RODO)

source: <div class="yp_checkboxes_legend"> <p>Every entry is to be stored in a separate line.<br />Format the checkboxes by following this pattern: <br><em>[checkbox_name] * | Description, regular HTML is allowed here</em> where:</p> <p class="yp_legend"><strong>[</strong> Opening square bracket<br /> <strong>checkbox_name</strong> Checkbox name - only letter and underscores ( _ ); no spaces, numbers, special characters - just plain text<br /> <strong>]</strong> Closing square bracket<br /> <strong class="yp_star">*</strong> If the checkbox is mandatory to be checked enter asterisk right after closing bracket<br /> <strong>|</strong> The pipe character to separate checkbox name from checkbox content<br /> <strong>checkbox copy</strong> - regular HTML is allowed here. Do NOT copy text from other visual editors as they tend to attach hidden elements along with the text</p></div>
pl_pl: <div class="yp_checkboxes_legend"> <p>Każde pole (checkbox) musi być opisany w osobnej linii.<br />Zapisz pola wyboru wg poniższego wzoru: <br><em>[nazwa_pola_wyboru] * | Treść (opis) pola; format HTML jest tu dozwolony</em> gdzie:</p> <p class="yp_legend"><strong>[</strong> Otwierający nawias kwadratowyt<br /> <strong>nazwa_pola_wyboru</strong> Nazwa - wyłącznie litery i podkreślniki ( _ ); żadnych spacji, cyfr lub znaków specjalnych wyłącznie czysty tekst<br /> <strong>]</strong> Zamykający nawias kwadratowy<br /> <strong class="yp_star">*</strong> Jeśli zaznaczenie pola (checkboxa) jest wymagane, dodaj gwiazdkę tuż po zamykającym nawiasie kwadratowym<br /> <strong>|</strong> Kreska pionowa (pipe) do oddzielenia nazwy od treści pola wyboru<br /> <strong>Treść pola (checkboxa)</strong> - dozwolony jest format HTML. NIE WKLEJAJ treści z innych edytorów (np. Worda), które wraz z kopiowanym tekstem przenoszą ukryte elementy HTML</p></div>

source: Display on the Front?
pl_pl: Wyświetlić na stronie?

source: Mark YES if you are sure you want to publish the checkboxes on the front page
pl_pl: Zaznacz TAK jeśli masz pewność, że chcesz upublicznić zgody

source: You must re-type your password
pl_pl: Musisz powtórzyć hasło

source: Passwords provided don't match
pl_pl: Hasła nie pasują do siebie

source: Visualization of the checkboxes
pl_pl: Wizualizacja pól wyboru

source: Re-type password
pl_pl: Powtórz hasło
